{
  "language_name": "ไทย",
  "common": {
    "button_cancel": "ยกเลิก",
    "button_confirm": "ยืนยัน",
    "button_delete": "ลบ",
    "button_ok": "ตกลง",
    "unknown": "ไม่ทราบ"
  },
  "card": {
    "name": "ชื่อ",
    "description": "คำอธิบาย",
    "ability": "ความสามารถ",
    "no_name": "ไม่มีชื่อ",
    "no_description": "ไม่มีคำอธิบาย",
    "no_image": "ไม่มีรูปภาพ",
    "no_result": "ไม่พบการ์ดที่ตรงกับการค้นหาของคุณ"
  },
  "nfc_snack_bar": {
    "success_read_tag": "อ่านการ์ดจากแท็ก NFC สำเร็จแล้ว",
    "success_write_tag": "บันทึกข้อมูลการ์ดลงในแท็ก NFC สำเร็จแล้ว",
    "warning_rewrite_card": "แท็กนี้มีข้อมูลของการ์ดนี้อยู่แล้ว กำลังเขียนข้อมูลเดิมซ้ำอีกครั้ง",

    "error_unavailable": "อุปกรณ์นี้ไม่รองรับ NFC",
    "error_start_session": "ไม่สามารถเริ่มเซสชัน NFC ได้ กรุณาลองใหม่อีกครั้ง",
    "error_restart_session": "เซสชัน NFC หมดอายุ กำลังเริ่มใหม่...",
    "error_process_tag": "เกิดข้อผิดพลาดขณะประมวลผลแท็ก NFC",
    "error_read_tag": "ไม่สามารถอ่านข้อมูลจากแท็ก NFC ได้ กรุณาลองใหม่อีกครั้ง",
    "error_write_tag": "ไม่สามารถเขียนข้อมูลลงแท็ก NFC ได้ กรุณาตรวจสอบว่าแท็กสามารถเขียนได้และมีพื้นที่เพียงพอ แล้วลองใหม่อีกครั้ง",

    "error_ndef_not_supported": "แท็กนี้ไม่รองรับรูปแบบ NDEF",
    "error_ndef_not_writable": "แท็ก NFC นี้เป็นแบบอ่านอย่างเดียว ไม่สามารถเขียนได้",
    "error_ndef_parse_failed": "ไม่สามารถอ่านข้อมูลจากแท็กได้ อาจเกิดจากรูปแบบไม่ถูกต้องหรือไม่มีข้อมูล",
    "error_ndef_create_failed": "ไม่สามารถเตรียมข้อมูลสำหรับแท็กได้ กรุณาตรวจสอบข้อมูลการ์ด",
    "error_ndef_data_too_large": "ข้อมูลมีขนาดใหญ่เกินกว่าจะเก็บในแท็กนี้ได้",

    "error_tag_not_detected": "ไม่พบแท็ก NFC กรุณานำแท็กไปใกล้อุปกรณ์",
    "error_card_not_found": "ไม่พบการ์ดที่ตรงกับแท็กนี้",
    "error_game_not_supported": "แอปนี้ไม่รองรับเกมนี้",

    "error_unknown": "เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ กรุณาลองใหม่ภายหลัง"
  },
  "bottom_navigation_bar": {
    "deck_list": "เด็ค",
    "card_reader": "อ่าน",
    "setting": "ตั้งค่า"
  },
  "page_landing": {
    "app_name": "ตัวติดตามเด็ค",
    "app_description": "ด้วยเทคโนโลยี NFC และแอปนี้ การจัดการการ์ดของคุณจะง่ายดาย! เพียงแค่สแกน ติดตาม และจัดระเบียบการ์ดในเด็คของคุณอย่างง่ายดาย คุณจะรู้เสมอว่ามีอะไรอยู่ในเด็ค ช่วยให้คุณมีสมาธิและสนุกกับเกมได้มากขึ้น!",
    "button_get_started": "เริ่มต้น"
  },
  "page_sign_in": {
    "title": "มาเริ่มกันเลย!",
    "offline_message": "คุณกำลังออฟไลน์อยู่\nไม่สามารถเข้าสู่ระบบด้วยวิธีอื่นได้",
    "snack_bar_sign_in_fail": "เข้าสู่ระบบล้มเหลว กรุณาตรวจสอบข้อมูลและลองใหม่อีกครั้ง",
    "snack_bar_sign_in_error_unknow": "เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุขณะเข้าสู่ระบบ กรุณาลองใหม่ภายหลัง",
    "button_guest_sign_in": "เข้าสู่ระบบแบบผู้เยี่ยมชม"
  },
  "page_deck_list": {
    "app_bar": "เด็คของฉัน",
    "empty_message": "แตะที่ไอคอนด้านซ้ายบน\nเพื่อสร้างเด็ค"
  },
  "page_deck_create": {
    "app_bar": "เด็คใหม่",
    "toggle_save": "บันทึก",
    "toggle_edit": "แก้ไข",
    "dialog_delete_title": "ลบการ์ดทั้งหมด",
    "dialog_delete_content": "คุณแน่ใจหรือไม่ว่าต้องการลบการ์ดทั้งหมดในเด็คนี้?\nการกระทำนี้ไม่สามารถย้อนกลับได้",
    "snack_bar_delete": "ลบการ์ดทั้งหมดในเด็คเรียบร้อยแล้ว",
    "snack_bar_share": "ข้อมูลเด็คของคุณถูกคัดลอกไปยังคลิปบอร์ดแล้วเพื่อให้ง่ายต่อการแชร์",
    "clipboard_deck_name": "ชื่อเด็ค",
    "clipboard_total_cards": "รวมทั้งหมด {total} การ์ด",
    "empty_message": "แตะ '+' เพื่อเพิ่มการ์ด\nลงในเด็คของคุณ"
  },
  "page_deck_tracker": {
    "app_bar": "ตัวติดตามเด็ค",
    "toggle_create_room": "สร้างห้อง",
    "toggle_join_room": "เข้าร่วมห้อง",
    "dialog_tracker_tutorial_title": "การติดตามการ์ด",
    "dialog_tracker_tutorial_content": "คุณสามารถสแกนการ์ดของคุณระหว่างเล่นเกมเพื่อจัดการเด็คได้ การสแกนแต่ละครั้งจะอัปเดตสถานะของเด็ค—การ์ดที่สแกนจะถูกลบออก และการ์ดที่สแกนซ้ำจะถูกเพิ่มกลับ กด 'ตกลง' เพื่อดำเนินการต่อ",
    "dialog_reset_deck_title": "คุณต้องการรีเซ็ตหรือไม่?",
    "dialog_reset_deck_content": "คุณสามารถเลือกบันทึกเกมหรือรีเซ็ตได้เลย",
    "dialog_room_feature_title": "ต้องเข้าสู่ระบบ",
    "dialog_room_feature_content": "กรุณาเข้าสู่ระบบก่อนจึงจะสามารถใช้ฟีเจอร์นี้ได้ การสร้างหรือเข้าร่วมห้องสามารถทำได้เฉพาะผู้ใช้ที่เข้าสู่ระบบแล้วเท่านั้น",
    "snack_bar_not_part_of_current_deck": "การ์ดนี้ไม่อยู่ในเด็คปัจจุบัน",
    "button_reset": "รีเซ็ต",
    "button_save": "บันทึก",
    "switch_mode_deck": "เด็ค",
    "switch_mode_insight": "ข้อมูลเชิงลึก",
    "total_cards": "รวมทั้งหมด {card} การ์ด",
    "draw": "จั่ว",
    "return": "คืน",
    "summerize_title": "สรุปผล",
    "summarize_percentage_played": "เล่นการ์ดไปแล้ว {percentage}% จากเด็ค",
    "summarize_total_action": "จั่วทั้งหมด {draw} คืน {return}",
    "summarize_unused_card": "ไม่ได้ใช้ {unused} การ์ด",
    "history_title": "ประวัติ"
  },
  "page_join_room": {
    "app_bar": "เข้าร่วมห้อง",
    "tip": "สแกน QR Code บนหน้า\nตัวติดตามเด็คเพื่อเข้าร่วมห้อง"
  },
  "page_card_reader": {
    "app_bar": "อ่านแท็ก"
  },
  "page_collection": {
    "app_bar": "เกม",
    "toggle_new": "ใหม่",
    "dialog_create_title": "ชื่อคอลเลกชัน",
    "last_updated": "อัปเดตล่าสุดเมื่อ {date}"
  },
  "page_browse_card": {
    "app_bar": "ค้นหา",
    "toggle_create": "สร้าง",
    "search_hint_text": "กรอกชื่อการ์ด",
    "empty_collection": "ไม่มีการ์ดในคลัง",
    "error_fetch_card": "ดึงข้อมูลการ์ดไม่สำเร็จ กรุณาลองใหม่ภายหลัง",
    "empty_search_result": "ไม่พบการ์ดที่ตรงกับการค้นหา"
  },
  "page_card_detail": {
    "app_bar_card": "ข้อมูลการ์ด",
    "app_bar_custom": "กำหนดเอง",
    "toggle_add": "เพิ่ม",
    "snack_bar_add": "เพิ่มการ์ดลงในเด็คของคุณเรียบร้อยแล้ว!",
    "upload_image": "อัปโหลดรูปภาพ"
  },
  "page_setting": {
    "app_bar": "การตั้งค่า",
    "section_account_label": "บัญชี",
    "section_account_email": "อีเมล",
    "section_account_library": "คลัง",
    "section_account_sign_in": "เข้าสู่ระบบ",
    "section_account_sign_out": "ออกจากระบบ",
    "section_app_info_label": "ข้อมูลแอป",
    "section_app_info_about": "เกี่ยวกับ",
    "section_app_info_privacy": "นโยบายความเป็นส่วนตัว",
    "section_app_info_terms": "เงื่อนไขการใช้งาน",
    "section_preferences_label": "การตั้งค่าทั่วไป",
    "section_preferences_language": "ภาษา",
    "section_preferences_dark_mode": "โหมดมืด",
    "section_preferences_light_mode": "โหมดสว่าง"
  },
  "page_library": {
    "app_bar": "คลัง",
    "empty_message": "เรียกดูการ์ดและเด็คทั้งหมด\nที่คุณได้สร้างหรือบันทึกไว้"
  },
  "page_about": {
    "app_bar": "เกี่ยวกับ",
    "content": "NFC Deck Tracker เป็นแอปพลิเคชันมือถือที่พัฒนาขึ้นเพื่อเสริมประสบการณ์ของผู้เล่นเกมการ์ดสะสม (TCG) โดยมีเครื่องมือครบครันสำหรับการสร้างเด็ค จัดระเบียบ และติดตามแบบเรียลไทม์ รองรับทั้งในช่วงเตรียมตัวและขณะเล่นเกม\n\nแอปใช้เทคโนโลยี NFC (Near Field Communication) เพื่อให้ผู้เล่นสามารถโต้ตอบกับการ์ดได้อย่างไร้รอยต่อ พร้อมติดตามการใช้การ์ดในเวลาจริง และวิเคราะห์เด็คได้อย่างมีประสิทธิภาพ โดยสามารถใช้งานแบบออฟไลน์ หรือเลือกซิงค์ข้อมูลระหว่างอุปกรณ์ได้ตามต้องการ\n\nแอปพลิเคชันนี้พัฒนาขึ้นเป็นส่วนหนึ่งของโครงงานวิทยานิพนธ์ โดย NsamaX คณะวิทยาศาสตร์ มหาวิทยาลัยศิลปากร\n\nเวอร์ชัน: {version}"
  },
  "page_privacy": {
    "app_bar": "ความเป็นส่วนตัว",
    "content": "NFC Deck Tracker พัฒนาด้วยความมุ่งมั่นในการปกป้องความเป็นส่วนตัวของผู้ใช้ แอปไม่จำเป็นต้องส่งหรือเก็บข้อมูลส่วนบุคคลใด ๆ ทั้งสิ้น ไม่มีข้อมูลส่วนตัวใด ๆ ที่ถูกเก็บ ประมวลผล จัดเก็บ หรือส่งต่อไปยังบุคคลที่สาม\n\nการทำงานทั้งหมดภายในแอป — รวมถึงการสร้าง แก้ไข ติดตาม และจัดเก็บเด็คการ์ด — จำกัดอยู่เพียงเพื่อการใช้งานส่วนตัวหรือเพื่อความบันเทิงเท่านั้น การใช้งาน NFC มีไว้เพื่อการตรวจจับการ์ดและจัดการเด็คในอุปกรณ์ของผู้ใช้เองเท่านั้น แอปจะไม่ส่ง วิเคราะห์ หรือเผยแพร่ข้อมูล ยกเว้นในกรณีที่ผู้ใช้เปิดใช้งานการซิงค์ข้อมูลผ่านคลาวด์ด้วยตนเอง\n\nซอฟต์แวร์นี้ออกแบบมาเพื่อใช้งานแบบไม่แสวงหากำไร ไม่ใช้แข่งขัน และไม่ละเมิดสิทธิ์ การใช้งานใด ๆ ที่ละเมิดกฎของบุคคลที่สาม เช่น ผู้จัดจำหน่ายเกม หรือผู้จัดการแข่งขัน ถือเป็นความรับผิดชอบของผู้ใช้แต่เพียงผู้เดียว นักพัฒนาไม่มีส่วนร่วมในความเสียหาย ข้อพิพาท หรือบทลงโทษที่เกิดจากการใช้งานผิดวัตถุประสงค์\n\nการใช้งานแอปต่อไป ถือว่าผู้ใช้เข้าใจและยอมรับเงื่อนไขเหล่านี้ และจะใช้งานภายใต้เจตนารมณ์ที่ดีและภายใต้วัตถุประสงค์ที่กำหนดไว้เท่านั้น"
  },
  "page_terms_of_use": {
    "app_bar": "เงื่อนไขการใช้งาน",
    "content": "วันที่มีผล: 25 เมษายน 2025\n\nเมื่อคุณดาวน์โหลด ติดตั้ง หรือใช้งานแอป NFC Deck Tracker (\"แอปพลิเคชัน\") ถือว่าคุณตกลงยอมรับข้อกำหนดและเงื่อนไขต่อไปนี้ หากคุณไม่เห็นด้วย กรุณาอย่าใช้งานแอป\n\n1. ใบอนุญาตการใช้งาน\nแอปพลิเคชันมีไว้เพื่อการใช้งานส่วนตัว ไม่ใช่เชิงพาณิชย์ คุณได้รับสิทธิ์การใช้งานแบบจำกัด ไม่เฉพาะเจาะจง ไม่สามารถโอนสิทธิ์ และสามารถเพิกถอนสิทธิ์ได้ทุกเมื่อเพื่อใช้ตามวัตถุประสงค์ของแอป\n\nคุณไม่สามารถ:\n\nทำซ้ำ แจกจ่าย หรือให้สิทธิ์ใช้งานต่อ ไม่ว่าทั้งหมดหรือบางส่วนของแอปพลิเคชัน\n\nดัดแปลง แก้ไข ถอดรหัส แยกโปรแกรม หรือพยายามเข้าถึงซอร์สโค้ดของแอปพลิเคชัน\n\nใช้งานแอปในทางที่ละเมิดกฎหมาย สิทธิ์ของบุคคลที่สาม หรือกฎของเกมและการแข่งขัน\n\n2. ทรัพย์สินทางปัญญา\nสิทธิ์ทั้งหมดในแอปพลิเคชัน รวมถึงอินเทอร์เฟซการใช้งาน การออกแบบ และซอร์สโค้ด (ยกเว้นส่วนที่ใช้โอเพนซอร์ส) ยังคงเป็นของนักพัฒนา\n\n3. การใช้งานที่เหมาะสม\nแอปมีวัตถุประสงค์เพื่อช่วยติดตามเด็คในการเล่นเกมการ์ดสะสมเพื่อความบันเทิงเท่านั้น นักพัฒนาไม่อนุญาตให้ใช้แอปในบริบทการแข่งขันหรือทางการ เว้นแต่จะได้รับอนุญาตโดยชัดแจ้งจากหน่วยงานที่เกี่ยวข้อง\n\n4. การจำกัดความรับผิด\nแอปพลิเคชันให้บริการ \"ตามสภาพที่เป็นอยู่\" โดยไม่มีการรับประกันใด ๆ นักพัฒนาไม่รับผิดชอบต่อความเสียหาย การสูญเสีย หรือข้อพิพาทที่เกิดจากการใช้งานที่ไม่เหมาะสม หรือดัดแปลงแอปโดยไม่ได้รับอนุญาต\n\n5. การเปลี่ยนแปลงเงื่อนไข\nนักพัฒนาขอสงวนสิทธิ์ในการแก้ไขหรือปรับปรุงเงื่อนไขเหล่านี้ได้ตลอดเวลาโดยไม่แจ้งให้ทราบล่วงหน้า ผู้ใช้มีหน้าที่ตรวจสอบหน้าเงื่อนไขนี้เป็นระยะ การใช้งานแอปต่อไปหลังการเปลี่ยนแปลงถือว่าคุณยอมรับเงื่อนไขใหม่แล้ว"
  },
  "page_language": {
    "app_bar": "ภาษา"
  },
  "page_not_found": {
    "title": "ไม่พบหน้านี้",
    "button_back": "ย้อนกลับ"
  }
}
